In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('car data (1).csv')
df.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

In [3]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [4]:
print(df['Owner'].unique())
print(df['Fuel_Type'].unique())
print(df['Seller_Type'].unique())
print(df['Transmission'].unique())

[0 1 3]
['Petrol' 'Diesel' 'CNG']
['Dealer' 'Individual']
['Manual' 'Automatic']

In [5]:
df.replace({'Diesel':0,'Petrol':1,'CNG':2,'Manual':0,'Automatic':1,'Individual':0,'Dealer':1},inplace=True)
df.tail()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
296,city,2016,9.50,11.6,33988,0,1,0,0
297,brio,2015,4.00,5.9,60000,1,1,0,0
298,city,2009,3.35,11.0,87934,1,1,0,0
299,city,2017,11.50,12.5,9000,0,1,0,0
300,brio,2016,5.30,5.9,5464,1,1,0,0

In [6]:
df.drop(['Car_Name'],axis=1,inplace=True)

In [7]:
print(df.dtypes)
df.head()

Year               int64
Selling_Price    float64
Present_Price    float64
Kms_Driven         int64
Fuel_Type          int64
Seller_Type        int64
Transmission       int64
Owner              int64
dtype: object

,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,2014,3.35,5.59,27000,1,1,0,0
1,2013,4.75,9.54,43000,0,1,0,0
2,2017,7.25,9.85,6900,1,1,0,0
3,2011,2.85,4.15,5200,1,1,0,0
4,2014,4.60,6.87,42450,0,1,0,0

In [8]:
x=df.drop(['Selling_Price'],axis=1)
y=df['Selling_Price']

In [9]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=2)

In [10]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model.fit(x_train,y_train)
y_predict=model.predict(x_test)
from sklearn.metrics import r2_score
r2_score(y_test,y_predict)

0.8488587201210601

In [11]:
final=np.array([2014,8.0,42450,0,1,0,0])
prediction=model.predict(final.reshape(1,-1))
output=round(prediction[0],2)
print(output)

6.88

In [12]:
import pickle
pickle.dump(model,open("model.pkl","wb"))

In [13]:
x.columns

Index(['Year', 'Present_Price', 'Kms_Driven', 'Fuel_Type', 'Seller_Type',
       'Transmission', 'Owner'],
      dtype='object')